In [229]:
pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (1.4.2)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: numpy>=1.18.5 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [230]:
import pandas as pd
import numpy as np

### Data structure in pandas module

In [231]:
# there are 3 data structures provided by pandas module, which are as 
# series 1

#a series is a very similar to numpy array. what differentiates the numpy array from a series , is that a series can have axis
#labels, meaning it can be indexed by a label

la= ['a','b','c']

In [232]:
pd.Series()

C:\Users\cdac\AppData\Local\Temp\ipykernel_9220\3134564496.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  pd.Series()

Series([], dtype: float64)

In [233]:
# using list
m=[12,34,12]
a=pd.Series(data=m,index=la)

In [234]:
pd.Series(a,la)

a    12
b    34
c    12
dtype: int64

In [235]:
pd.Series(la)

0    a
1    b
2    c
dtype: object

In [236]:
ser2= pd.Series([1,2,3,4],index=["ptk","kullu","shimla","lahore"])
ser1= pd.Series([1,2,3,4],index=["stk","thullu","vimla","sahore"])

In [237]:
ser2["ptk"]

1

In [238]:
s=ser2*ser1

In [239]:
r=[2,7]
ser=pd.Series(r,copy=False)
ser.iloc[0]=20
r

[2, 7]

In [240]:
ser

0    20
1     7
dtype: int64

In [241]:
ser

0    20
1     7
dtype: int64

# DATA FRAMES

In [242]:
pd.DataFrame() # create an empty data frames

Empty DataFrame
Columns: []
Index: []

In [243]:
pf=pd.DataFrame(np.random.randn(5,4),index='A B C D E'.split(),columns='w x y z'.split())
pf

          w         x         y         z
A  0.053495 -0.354288  0.426445 -1.072056
B -0.613930 -0.602843 -0.858265  0.797080
C -0.450869 -0.044087  0.708972 -0.418891
D -0.777023 -1.399740  0.247500  1.187554
E  1.016631  0.141051  0.970573 -1.146139

In [244]:
df={
    "Name":['Rahul','Archana','Garish','Anjali','Anmol','Monika'],
   "Subjects":['Python','c++','java','php','ruby','javascript'],
   "Marks":[70,77,75,67,85,90],
   "Highest Marks":[34,67,98,23,90,99]
}

In [245]:
d=pd.DataFrame(df)

In [246]:
d.head(2)

      Name Subjects  Marks  Highest Marks
0    Rahul   Python     70             34
1  Archana      c++     77             67

In [247]:
d.dtypes

Name             object
Subjects         object
Marks             int64
Highest Marks     int64
dtype: object

In [248]:
d.index

RangeIndex(start=0, stop=6, step=1)

In [249]:
d.columns

Index(['Name', 'Subjects', 'Marks', 'Highest Marks'], dtype='object')

# stastical summary of records

In [250]:
d.describe()

           Marks  Highest Marks
count   6.000000       6.000000
mean   77.333333      68.500000
std     8.778762      33.243044
min    67.000000      23.000000
25%    71.250000      42.250000
50%    76.000000      78.500000
75%    83.000000      96.000000
max    90.000000      99.000000

In [251]:
d['Marks'].describe()

count     6.000000
mean     77.333333
std       8.778762
min      67.000000
25%      71.250000
50%      76.000000
75%      83.000000
max      90.000000
Name: Marks, dtype: float64

In [252]:
d.describe(include="all")  #get all columns of a dataframe regardless of data types.

         Name Subjects      Marks  Highest Marks
count       6        6   6.000000       6.000000
unique      6        6        NaN            NaN
top     Rahul   Python        NaN            NaN
freq        1        1        NaN            NaN
mean      NaN      NaN  77.333333      68.500000
std       NaN      NaN   8.778762      33.243044
min       NaN      NaN  67.000000      23.000000
25%       NaN      NaN  71.250000      42.250000
50%       NaN      NaN  76.000000      78.500000
75%       NaN      NaN  83.000000      96.000000
max       NaN      NaN  90.000000      99.000000

In [253]:
a=pd.DataFrame({'category':pd.Categorical(['d','e','f']),
               'numeric':[1,2,3],
               'object':['a','b','c']})
a.describe(include=['category'])

       category
count         3
unique        3
top           d
freq          1

In [254]:
d[['Name','Subjects']]

      Name    Subjects
0    Rahul      Python
1  Archana         c++
2   Garish        java
3   Anjali         php
4    Anmol        ruby
5   Monika  javascript

In [255]:
# dataframe columns are just series

type(d["Subjects"])

pandas.core.series.Series

In [256]:
d[0:3]

      Name Subjects  Marks  Highest Marks
0    Rahul   Python     70             34
1  Archana      c++     77             67
2   Garish     java     75             98

In [257]:
d
d.iloc[2]

Name             Garish
Subjects           java
Marks                75
Highest Marks        98
Name: 2, dtype: object

In [258]:
d.loc[2,"Subjects"]     # define both index and name

'java'

In [259]:
# creating a new coloums

d['new_col']=d['Marks']+d['Highest Marks']
d

      Name    Subjects  Marks  Highest Marks  new_col
0    Rahul      Python     70             34      104
1  Archana         c++     77             67      144
2   Garish        java     75             98      173
3   Anjali         php     67             23       90
4    Anmol        ruby     85             90      175
5   Monika  javascript     90             99      189

In [260]:
d.drop('new_col',axis=1)

      Name    Subjects  Marks  Highest Marks
0    Rahul      Python     70             34
1  Archana         c++     77             67
2   Garish        java     75             98
3   Anjali         php     67             23
4    Anmol        ruby     85             90
5   Monika  javascript     90             99

In [261]:
d     # the new col will not drop form orginal until we specify inplace=true

      Name    Subjects  Marks  Highest Marks  new_col
0    Rahul      Python     70             34      104
1  Archana         c++     77             67      144
2   Garish        java     75             98      173
3   Anjali         php     67             23       90
4    Anmol        ruby     85             90      175
5   Monika  javascript     90             99      189

In [262]:
#d.drop(4,axis=0,inplace=True)         # it will originallly remove the 4th row
d

      Name    Subjects  Marks  Highest Marks  new_col
0    Rahul      Python     70             34      104
1  Archana         c++     77             67      144
2   Garish        java     75             98      173
3   Anjali         php     67             23       90
4    Anmol        ruby     85             90      175
5   Monika  javascript     90             99      189

In [263]:
d['Marks']>70

0    False
1     True
2     True
3    False
4     True
5     True
Name: Marks, dtype: bool

In [264]:
d[d['Name'].isin(['Rahul','Monika'])] # asking specific names form data set

     Name    Subjects  Marks  Highest Marks  new_col
0   Rahul      Python     70             34      104
5  Monika  javascript     90             99      189

In [265]:
d[d["Marks"]>70]["Name"]

1    Archana
2     Garish
4      Anmol
5     Monika
Name: Name, dtype: object

In [267]:
d[d["Highest Marks"]>35][['Name','Subjects']]

      Name    Subjects
1  Archana         c++
2   Garish        java
4    Anmol        ruby
5   Monika  javascript

In [278]:
d[ (d["Marks"]>70) | (d['Highest Marks']>35)   ]

      Name    Subjects  Marks  Highest Marks  new_col
1  Archana         c++     77             67      144
2   Garish        java     75             98      173
4    Anmol        ruby     85             90      175
5   Monika  javascript     90             99      189

In [279]:
d[ (d["Marks"]>70) & (d['Highest Marks']>35)   ]

      Name    Subjects  Marks  Highest Marks  new_col
1  Archana         c++     77             67      144
2   Garish        java     75             98      173
4    Anmol        ruby     85             90      175
5   Monika  javascript     90             99      189

# Renaming the coloumn

In [285]:
d.rename(columns={"Highest Marks":"Avg Marks"},inplace=True)
d

      Name    Subjects  Marks  Avg Marks  new_col
0    Rahul      Python     70         34      104
1  Archana         c++     77         67      144
2   Garish        java     75         98      173
3   Anjali         php     67         23       90
4    Anmol        ruby     85         90      175
5   Monika  javascript     90         99      189